Mi az a DataFrame?

Egyszerűen fogalmazva, a DataFrame-ek a Python módszerei az adatok táblázatos formában történő megjelenítésére.

A Python hatékony adatelemzési könyvtárának – pandas with DataFrames – használatával hatékony módszert kínál a nagy mennyiségű strukturált adatkezelésre.
Hasonló az Excelhez?

<img src="df_spreadsheet.png" height = "200" weight = "400"><br>
Ahogy az Excel táblázatokat, a Python panda adatkereteket használ. Skálázhatósága és sebessége miatt gyakran előnyben részesítik a Pythont az Excellel szemben.
Hogyan épül fel a DataFrame?

Tehát hogyan néz ki egy DataFrame? <br>Sorokból és oszlopokból áll, így kétdimenziós. Vessünk egy pillantást alább:
<img src="df_components.png"><br>
Látjuk, hogy az indexünk a vállalatokból áll, de egy index számokból is állhat.

     Az index olyan, mint egy cím: sorok és oszlopok megkeresésére is használható.

Erről majd később.

Tehát ugorjunk a Jupyter jegyzetfüzetünkbe, és hozzuk létre a DataFrame-et ebből a példából.

A mai labor adatkészlete információkat tartalmaz a világ legjobb technológiai vállalatairól, az alábbiak szerint:

<img src="tech_table.png"><br>

A DataFrame öt oszlopot tartalmaz: - Bevétel - Alkalmazottak - Ágazat - Alapítás dátuma - Ország

Az adatkeret létrehozásának szintaxisa a következő:

<code>
import pandas as pd

pd.DataFrame(data, index)
</code>

data: Ezek az adatok az adatkészletünkből.

index: Ez olyan, mint az általunk tárolt adatok címe.

In [1]:
import pandas as pd

In [2]:
#Üres df
df = pd.DataFrame()

In [3]:
#Az adatok
data = {'Revenue': [274515,200734,182527,181945,143015,129184,92224,85965,84893,
                    82345,77867,73620,69864,63191],
        'Employees': [147000,267937,135301,878429,163000,197000,158000,58604,
                      109700,350864,110600,364800,85858,243540],
        'Sector': ['Consumer Electronics','Consumer Electronics','Software Services',
                   'Chip Manufacturing','Software Services','Consumer Electronics',
                   'Consumer Electronics','Software Services','Consumer Electronics',
                   'Consumer Electronics','Chip Manufacturing','Software Services',
                   'Software Services','Consumer Electronics'],
        'Founding Date':['01-04-1976','13-01-1969','04-09-1998','20-02-1974',
                         '04-04-1975','15-09-1987','01-02-1984','04-02-2004',
                         '07-04-1946','01-01-1910','18-07-1968','16-06-1911',
                         '11-11-1998','07-03-1918'],
        'Country':['USA','South Korea','USA','Taiwan','USA','China','USA','USA',
                   'Japan','Japan','USA','USA','China','Japan']} 
index = ['Apple','Samsung','Alphabet','Foxconn','Microsoft','Huawei',
         'Dell Technologies','Meta','Sony','Hitachi','Intel','IBM',
         'Tencent','Panasonic']

In [4]:
df = pd.DataFrame(data, index)

In [5]:
df.head()

           Revenue  Employees                Sector Founding Date      Country
Apple       274515     147000  Consumer Electronics    01-04-1976          USA
Samsung     200734     267937  Consumer Electronics    13-01-1969  South Korea
Alphabet    182527     135301     Software Services    04-09-1998          USA
Foxconn     181945     878429    Chip Manufacturing    20-02-1974       Taiwan
Microsoft   143015     163000     Software Services    04-04-1975          USA

Alapvető navigációs és böngészési technikák

Szóval, hogyan használjuk ki igazán a pandák DataFrames erejét?

Nézzünk meg néhány funkciót:

a) head

A head() metódus megjeleníti a DataFrame első néhány sorát, így könnyebben áttekinthető az általános szerkezet és a tartalom. Alapértelmezés szerint az első öt sort fogja megjeleníteni.

<code>
df.head()
</code>

Tovább bővíthetjük adatkészletünket, és megadhatjuk a .head(n) sorok számát a zárójelben, az alábbiak szerint:

<code>
df.head(10)
</code>

Ez a funkció különösen hasznos, mivel gyorsan ellenőrizheti a DataFrame-et a head() metódussal, hogy megbizonyosodjon arról, hogy az összes adat megfelelően és az elvárásoknak megfelelően kerül tárolásra.

In [6]:
df.head(10)

,Revenue,Employees,Sector,Founding Date,Country
Apple,274515,147000,Consumer Electronics,01-04-1976,USA
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea
Alphabet,182527,135301,Software Services,04-09-1998,USA
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan
Microsoft,143015,163000,Software Services,04-04-1975,USA
Huawei,129184,197000,Consumer Electronics,15-09-1987,China
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA
Meta,85965,58604,Software Services,04-02-2004,USA
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan

b) tail

A tail() metódus hasonló a head() metódushoz, kivéve, hogy megjeleníti a DataFrame utolsó néhány sorát. .

df.tail()

Szintén a head()-hez hasonlóan a .tail(n)-nel megadhatjuk a megjeleníteni kívánt sorok számát.

df.tail(10)

     Ez hasznos az adatkészlettel kapcsolatos problémák gyors azonosításához, mivel minden hiba valószínűleg a végén, nem pedig az elején található.

In [7]:
df.tail()

           Revenue  Employees                Sector Founding Date Country
Hitachi      82345     350864  Consumer Electronics    01-01-1910   Japan
Intel        77867     110600    Chip Manufacturing    18-07-1968     USA
IBM          73620     364800     Software Services    16-06-1911     USA
Tencent      69864      85858     Software Services    11-11-1998   China
Panasonic    63191     243540  Consumer Electronics    07-03-1918   Japan

c) info

Az info() metódus visszaadja a DataFrame összes oszlopának listáját a nevükkel, az adattípusokkal, az értékek számával és a memóriahasználattal együtt.

df.info()

     Így könnyen betekintést nyerhet abba, hogy mennyi helyet foglalnak el az egyes oszlopok, és segíthet azonosítani a lehetséges problémákat, például a hiányzó értékeket vagy a helytelen adattípusokat.

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14 entries, Apple to Panasonic
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Revenue        14 non-null     int64
 1   Employees      14 non-null     int64
 2   Sector         14 non-null     object
 3   Founding Date  14 non-null     object
 4   Country        14 non-null     object
dtypes: int64(2), object(3)
memory usage: 672.0+ bytes

d) shape

A shape metódus egy sorokat és oszlopokat (sorok, oszlopok) ad vissza a DataFrame-ünkben.

df.shape

     Ez gyors betekintést nyújt a DataFrame dimenzióiba.

In [10]:
df.shape

(14, 5)

e) describe

A descibe() metódus leíró statisztikákat jelenít meg a DataFrame numerikus oszlopaihoz, beleértve az átlagot, a mediánt, a szórást, valamint a minimum és maximum értékeket.

df.describe()

     Ez nagyon hasznos lehet az értékek eloszlásának megértéséhez egy adott adatkészletben vagy oszlopban anélkül, hogy az egyes statisztikákat manuálisan kellene kiszámítani.

In [12]:
df.describe()

             Revenue      Employees
count      14.000000      14.000000
mean   124420.642857  233616.642857
std     63686.481231  207583.087389
min     63191.000000   58604.000000
25%     78986.500000  116775.250000
50%     89094.500000  160500.000000
75%    172212.500000  261837.750000
max    274515.000000  878429.000000

f) nunique

A nunique() metódus megszámolja a különböző elemek számát.

df.nunique()

     Ez nagyon hasznos lehet például az oszlopban található kategóriák számának megértéséhez.

In [13]:
df.nunique()

Revenue          14
Employees        14
Sector            3
Founding Date    14
Country           5
dtype: int64

g) isnull

Az isnull() metódus hiányzó értékeket észlelt egy DataFrame objektum létrehozásával, amelynek logikai értéke True a NULL értékekhez, egyébként pedig False.

df.isnull()

Ezt egy lépéssel tovább tehetjük, ha a sum() függvényt alkalmazzuk, hogy összesen NULL értéket kapjunk a DataFrame-ben.

df.isnull().sum()

In [14]:
df.isnull()

                   Revenue  Employees  Sector  Founding Date  Country
Apple                False      False   False          False    False
Samsung              False      False   False          False    False
Alphabet             False      False   False          False    False
Foxconn              False      False   False          False    False
Microsoft            False      False   False          False    False
Huawei               False      False   False          False    False
Dell Technologies    False      False   False          False    False
Meta                 False      False   False          False    False
Sony                 False      False   False          False    False
Hitachi              False      False   False          False    False
Intel                False      False   False          False    False
IBM                  False      False   False          False    False
Tencent              False      False   False          False    False
Panasonic            False      False   False          False    False

In [15]:
df.isnull().sum()

Revenue          0
Employees        0
Sector           0
Founding Date    0
Country          0
dtype: int64

Oszlop kiválasztása:

Mielőtt elkezdené ezt a részt, fontos, hogy különbséget tudjunk tenni a sorozat és a DataFrame között.

     A sorozat egyetlen oszlop a DataFrame-ben
     A DataFrame egy teljes adattábla.

Nézzük meg, hogyan választhatjuk ki ezeket a tételeket:
a) Válasszon ki egy oszlopot

A [] operátor használható egy adott oszlop kiválasztására egy DataFrame-en belül. A kimenet egy sorozat.

df['oszlop_neve']

In [16]:
df['Revenue']

Apple                274515
Samsung              200734
Alphabet             182527
Foxconn              181945
Microsoft            143015
Huawei               129184
Dell Technologies     92224
Meta                  85965
Sony                  84893
Hitachi               82345
Intel                 77867
IBM                   73620
Tencent               69864
Panasonic             63191
Name: Revenue, dtype: int64

b) Válasszon egy oszlopot, és alkalmazza a módszereket

A DataFrame-ek azt is lehetővé teszik a felhasználó számára, hogy metódusokat alkalmazzon az oszlopokon, ezek a függvények a sum(), mean(), min(), max(), median() és így tovább.

df['oszlop_neve'].sum()

In [17]:
df['Revenue'].sum()

1741889

c) Válassza ki a Több oszlopot

Több oszlop kijelöléséhez használja a [] operátort az oszlopnevek listájával argumentumként. Ezzel egy másik DataFrame-et hoz létre.

df[['oszlop_neve_1', 'oszlop_neve_2','oszlop_neve_3']]

Ezt az új DataFrame-et elmenthetjük új változónévvel, hogy később visszatérhessünk hozzá.

new_df = df[['oszlop_neve_1', 'oszlop_neve_2','oszlop_neve_3']]

In [19]:
df[['Revenue', 'Sector']]

                   Revenue                Sector
Apple               274515  Consumer Electronics
Samsung             200734  Consumer Electronics
Alphabet            182527     Software Services
Foxconn             181945    Chip Manufacturing
Microsoft           143015     Software Services
Huawei              129184  Consumer Electronics
Dell Technologies    92224  Consumer Electronics
Meta                 85965     Software Services
Sony                 84893  Consumer Electronics
Hitachi              82345  Consumer Electronics
Intel                77867    Chip Manufacturing
IBM                  73620     Software Services
Tencent              69864     Software Services
Panasonic            63191  Consumer Electronics

d) Select Multiple Columns and Apply Methods

We can take a shortcut and apply methods on more than one column at the same time.

df[['column_name_1', 'column_name_2','column_name_3']].mean()

In [21]:
df[['Revenue', 'Employees']].mean()

Revenue      124420.642857
Employees    233616.642857
dtype: float64

Kiválasztás Index alapján - loc

Index kijelölés A .loc egy Python DataFrames metódus, amely lehetővé teszi a felhasználók számára, hogy a DataFrame sorait és oszlopait címkéik vagy egész pozícióik alapján jelöljék ki.

     Leggyakrabban akkor használatos, amikor a felhasználónak hozzá kell férnie egy DataFrame bizonyos elemeihez, például ki kell jelölnie az összes sort egy adott címkével vagy értékekkel egy adott oszlopban.

df.loc[sor_címke, oszlopcímke]

Az összes adat meghívásához használhatjuk a : row_label vagy column_label helyett.

df.loc[:, oszlopcímke]

df.loc[sor_címke,:]

Több oszlopot is átadhatunk az oszlopcímke helyett, vagy több sort a sorcímke helyett.

df.loc[['sor_neve_1', 'sor_neve_2','sor_neve_3'], oszlopcímke]

df.loc[sor_címke,['oszlop_neve_1', 'oszlop_neve_2','oszlop_neve_3']]

In [22]:
df.loc['Samsung', 'Revenue']

200734

In [23]:
df.loc[:, 'Revenue']

Apple                274515
Samsung              200734
Alphabet             182527
Foxconn              181945
Microsoft            143015
Huawei               129184
Dell Technologies     92224
Meta                  85965
Sony                  84893
Hitachi               82345
Intel                 77867
IBM                   73620
Tencent               69864
Panasonic             63191
Name: Revenue, dtype: int64

In [24]:
df.loc['Samsung', :]

Revenue                        200734
Employees                      267937
Sector           Consumer Electronics
Founding Date              13-01-1969
Country                   South Korea
Name: Samsung, dtype: object

In [25]:
df.loc[['Samsung', 'Sony'],'Revenue']

Samsung    200734
Sony        84893
Name: Revenue, dtype: int64

In [26]:
df.loc['Apple', ['Employees', 'Country']]

Employees    147000
Country         USA
Name: Apple, dtype: object

A szeletelés a pandák hatékony funkciója, amely lehetővé teszi számunkra, hogy elérjük a DataFrame bizonyos részeit.

     start:stop:step

Ha nem adjuk meg a lépést, az alapértelmezett érték 1.
a) Oszlopokkal

df.loc[`sor_címke`, `oszlop_neve_start`:`oszlop_neve_stop`]

b) Sorokkal

df.loc[`sor_neve_start`:`sor_neve_stop` , `oszlop_címke`]

c) Lépésekkel

df.loc[`sor_címke`, `oszlop_neve_start`:`oszlop_neve_stop`:n]

df.loc[`sor_neve_start`:`sor_neve_stop`:n , `oszlop_címke`]

d) és lépéssel:

df.loc[:`, `oszlop_neve_start`:`oszlop_neve_stop`:n]

df.loc[`sor_neve_start`:`sor_neve_stop`:n , :]

In [31]:
rows = ['Apple','Samsung','Sony']
columns = ['Employees','Sector','Country']
df.loc[rows,columns]

         Employees                Sector      Country
Apple       147000  Consumer Electronics          USA
Samsung     267937  Consumer Electronics  South Korea
Sony        109700  Consumer Electronics        Japan

In [29]:
df.loc['Apple', 'Employees':'Founding Date']

Employees                      147000
Sector           Consumer Electronics
Founding Date              01-04-1976
Name: Apple, dtype: object

In [30]:
df.loc['Apple':'Sony', 'Employees']

Apple                147000
Samsung              267937
Alphabet             135301
Foxconn              878429
Microsoft            163000
Huawei               197000
Dell Technologies    158000
Meta                  58604
Sony                 109700
Name: Employees, dtype: int64

In [32]:
df.loc['Apple':'Sony':2, columns]

                   Employees                Sector Country
Apple                 147000  Consumer Electronics     USA
Alphabet              135301     Software Services     USA
Microsoft             163000     Software Services     USA
Dell Technologies     158000  Consumer Electronics     USA
Sony                  109700  Consumer Electronics   Japan

In [ ]:
df.loc['Apple':'Sony':2, :]

Válassza ki az Apple, az Alphabet és a Microsoft cégek bevételét, alkalmazottait és ágazatát

Most hasznosítsuk .loc kiválasztási készségeit. Az Ön feladata, hogy válassza ki a Bevétel, Alkalmazottak és Szektor oszlopokat az Apple, Alphabet és a Microsoft cégek számára. Az eredményt egy index_selection változóban kell tárolni, és egy DataFrame-nek kell lennie, így kell kinéznie:

In [35]:
df.loc[['Apple','Alphabet','Microsoft'],'Revenue':'Sector']

           Revenue  Employees                Sector
Apple       274515     147000  Consumer Electronics
Alphabet    182527     135301     Software Services
Microsoft   143015     163000     Software Services

Kiválasztás pozíció szerint - iloc

Pozíció szerinti kijelölés Az .iloc egy hasznos Python DataFrames módszer, amely lehetővé teszi a felhasználók számára, hogy a DataFrame sorait és oszlopait egész számok pozíciójuk alapján jelöljék ki.

     Ez különösen akkor hasznos, ha a felhasználóknak olyan elemekhez kell hozzáférniük a DataFrame-en belül, amelyek nem rendelkeznek címkékkel vagy konkrét oszlopnevekkel.

df.iloc[sorpozíció, oszloppozíció]

Az összes adat meghívásához használhatjuk a : row_position vagy column_position helyett.

df.iloc[:, oszlop_pozíciója]

df.iloc[sor_pozíció,:]

Több oszlopot is átadhatunk az oszlop_pozíciója helyett, vagy több sort a sor_pozíció helyett.

df.iloc[['sor_pozíció_1', 'sor_pozíció_2','sor_pozíció_3'], oszloppozíció]

df.iloc[sor_pozíció,['oszlop_pozíció_1', 'oszlop_pozíció_2','oszlop_pozíció_3']]

A szeletelés a pandák hatékony funkciója, amely lehetővé teszi számunkra, hogy elérjük a DataFrame bizonyos részeit.

     start:stop:step

a) Oszlopokkal

df.iloc[`sor_pozíció`, `oszlop_pozíció_kezdete`:`oszloppozíció_leállás`]

b) Sorokkal

df.iloc[`sor_pozíció_kezdete`:`sor_pozíció_stop` , `oszlop_pozíciója`]

c) Lépésekkel

df.iloc[`sor_pozíció`, `oszlop_pozíció_kezdete`:`oszlop_pozíció_stop`:n]

df.iloc[`row_position_start`:`row_position_stop`:n , `oszlop_pozíciója`]

d) és lépéssel:

df.iloc[:`, `column_position_start`:`column_position_stop`:n]

df.iloc[`row_position_start`:`row_position_stop`:n , :]

In [36]:
#Samsung bevétele
df.iloc[1, 0]

200734

In [37]:
# row_position
df.iloc[1,:]

Revenue                        200734
Employees                      267937
Sector           Consumer Electronics
Founding Date              13-01-1969
Country                   South Korea
Name: Samsung, dtype: object

In [38]:
# column_position
df.iloc[:,0]

Apple                274515
Samsung              200734
Alphabet             182527
Foxconn              181945
Microsoft            143015
Huawei               129184
Dell Technologies     92224
Meta                  85965
Sony                  84893
Hitachi               82345
Intel                 77867
IBM                   73620
Tencent               69864
Panasonic             63191
Name: Revenue, dtype: int64

In [39]:
# Multiple columns
df.iloc[[0,1,8], 0]

Apple      274515
Samsung    200734
Sony        84893
Name: Revenue, dtype: int64

In [40]:
# Multiple rows
df.iloc[0, [1,4]]

Employees    147000
Country         USA
Name: Apple, dtype: object

In [41]:
rows_i = [0,1,8]
columns_i = [1,2,4]

In [42]:
df.iloc[rows_i,columns_i]

         Employees                Sector      Country
Apple       147000  Consumer Electronics          USA
Samsung     267937  Consumer Electronics  South Korea
Sony        109700  Consumer Electronics        Japan

In [43]:
#Szeletelés oszloppal
df.iloc[0, 1:4]

Employees                      147000
Sector           Consumer Electronics
Founding Date              01-04-1976
Name: Apple, dtype: object

In [44]:
#Szeletelés sorral
df.iloc[0:8, 1]

Apple                147000
Samsung              267937
Alphabet             135301
Foxconn              878429
Microsoft            163000
Huawei               197000
Dell Technologies    158000
Meta                  58604
Name: Employees, dtype: int64

In [45]:
#Szeletelés lépéssel (minden második sor van kiválasztva)
df.iloc[0:9:2, columns_i]

                   Employees                Sector Country
Apple                 147000  Consumer Electronics     USA
Alphabet              135301     Software Services     USA
Microsoft             163000     Software Services     USA
Dell Technologies     158000  Consumer Electronics     USA
Sony                  109700  Consumer Electronics   Japan

Végezzen kijelölést az .iloc és a pozíciókiválasztás segítségével

Most itt az ideje, hogy gyakorlatba ültesse iloc készségeit. Az Ön feladata a 2., 4. és 6. pozícióban lévő cégek kiválasztása. És az oszlopok az 1., 2. és az utolsó pozícióban. Tárolja az eredményt a position_selection változóban.

In [53]:
df.head(6)

           Revenue  Employees                Sector Founding Date      Country
Apple       274515     147000  Consumer Electronics    01-04-1976          USA
Samsung     200734     267937  Consumer Electronics    13-01-1969  South Korea
Alphabet    182527     135301     Software Services    04-09-1998          USA
Foxconn     181945     878429    Chip Manufacturing    20-02-1974       Taiwan
Microsoft   143015     163000     Software Services    04-04-1975          USA
Huawei      129184     197000  Consumer Electronics    15-09-1987        China

In [63]:
rows = [1,3,5]
cols = [0,1,-1]
df.iloc[rows, cols]

         Revenue  Employees      Country
Samsung   200734     267937  South Korea
Foxconn   181945     878429       Taiwan
Huawei    129184     197000        China

A DataFrame és a megváltoztathatatlanság
Mi az a megváltoztathatatlanság?

A megváltoztathatatlanság a Python DataFrames kulcsfogalma, ami azt jelenti, hogy a DataFrame létrehozása után nem lehet megváltoztatni.

Ez azt jelenti, hogy a DataFrame-en belül végrehajtott bármilyen változtatás egy új DataFrame létrehozását eredményezi, nem pedig az eredeti módosítását. Erre korábban láttunk példát, amikor létrehoztuk a DataFramedf_new-t a df-ből származó eredményeink alapján.

Következtetés

A Python DataFrame fogalmainak és módszereinek megértésével magabiztosan használhatja a Pythont adatkészletek felfedezésére és elemzésére.

A Python DataFrame hatékony eszközök a nagy mennyiségű adat gyors és egyszerű kezelésére. Segítségével felfedezheti, megértheti és betekintést nyerhet adatkészleteibe, mindössze néhány sornyi kóddal.